// Room: /d/jingcheng/ljbzh.c
// Made by: ysgl

#include <ansi.h>
inherit ROOM;

void create()
{
	set("short", "[1;37mаЬ╪г╡╪в╞[2;37;0m");
	set("long", @LONG
Ё╓╟╡аЬ╪р╣д╡╪аоиЗрБвЖ╣╫ож╫Яюо╟ЕаЬтфлЛйжиоряйгхЩ╢Зё╛Ё╓╟╡Ёг
юО╣д╢С╩╖спг╝хк╪рр╙бРрбнОё╛в╪йг╣╫уБю╢я║║ёуЩцФспр╩уевом╘д╬
╣дЁ╓л╗ё╛╨СцФЁВжп╧рбЗак╦Вй╫╦ВяЫ╣дрбнОё╛п╛╧зж╝юЮ║ёмЫю╢ппхк
╡╩╤оё╛х╥йгиЗрБпкб║║ёг╫ио╧рвер╩уеефьр(sign)║ё
LONG
	);
	set("exits", ([ /* sizeof() == 1 */
		"east" : __DIR__"bdj1",
]));
	set("item_desc", ([
		"sign" : @TEXT
	уБюОйгаЬ╪г╡╪флё╛д©г╟нрцг©и╤╘вВё╗ёДёИёНёГё╘ё╨

ц╠всё╗ёХёАёТё╘ё╛н╖╫Мё╗ёСёЦёАёРёФё╘ё╛мБрбё╗ёСёУёИёТё╘ё╛
яЭ╢Ьё╗ёБёЕёЛёТё╘ё╛╡╪п╛ё╗ёСёХёОёЕёСё╘ё╝
ц©╪Чр╩а╫╩ф╫Пё╝
юЩвсё╨
ёДёИёНёГ║║ёСёУёИёТ║║ё╓ёхёиёыё╓  ме╫П╩фаЗеш  ёРёОёБёЕ

╡╪фл╬м╩А╟ОдЦвВр╩╪Ч╩фи╚╣д ёРёОёБёЕ║║╫пё╒ме╫П╩фаЗешё╒

$BLK$ - ╨зи╚            $NOR$ - ╩ж╦╢уЩЁёяуи╚
$RED$ - ╨Ли╚            $HIR$ - аа╨Ли╚
$GRN$ - бли╚            $HIG$ - аабли╚
$YEL$ - ма╩фи╚          $HIY$ - ╩фи╚
$BLU$ - иНю╤и╚          $HIB$ - ю╤и╚
$MAG$ - гЁвои╚          $HIM$ - ╥ш╨Ли╚
$CYN$ - ю╤бли╚          $HIC$ - лЛгЮи╚
$WHT$ - гЁ╩ри╚          $HIW$ - ╟ви╚
TEXT
	]));	
	set("objects", ([ /* sizeof() == 1 */
__DIR__"npc/liu" : 1,
	]));

	setup();
}
