//by dwolf
//97.11.16       

#include <ansi.h>
inherit ITEM;

void create()
{

        set_name(YEL"×ÝºáÌìÏÂ×ÜÍ¼"NOR, ({ "map"}));
	set_weight(300);
	set("unit", "ÕÅ");
	set("long", "        ×ÝºáÌìÏÂ×ÜÍ¼ \n"   
"                                                  ³¤°×É½        	 \n"
"				   ÌúÑªÉ½×¯ 		        	 \n"
"                       ****                                     	 \n"
"	               *²ÝÔ­*		           ==            	 \n"
"        Î÷ÏÄ           ****                      ·îÌì     Ñ¼ÂÌ½­	 \n"
"                                       Ñ©Í¤Õò                   	 \n"
"                                              /\/\              	 \n"
"                                            =É½º£¹Ø=   	 	 \n"
"                                  	=±±¾©=   	   	 	 \n"
"         ºÚÄ¾ÑÂ                                                 	 \n"
"         LLLLLL     	            	 	±£¶¨            	 \n"
"                   	 ~~~~~~                                  	 \n"
"                   	~~ÐÉÐÉÌ²~                                	 \n"
"      				~~~~»ÆºÓ~~~~~~~~~~               	 \n"
"                         	  ~~~~~~~                         	 \n"
"             	À¼ÖÝ  	     ½	          /\/\       	 ¼ÃÄÏ Ì©É½   ÅîÀ³\n"			   
"         Çàº£ºþ     ³¤°²   äü¹Ø ÂåÑôÉÙÁÖ ¿ª·â                   	 \n"
"     À¥ÂØÉ½	        »ªÉ½    ~~~~~~~~~~~~~~                   	 \n"
"				  ~~ ³¤½­~~	         	 	 \n"
"   ÌÆ¹ÅÀ­É½                                                     	 \n"
" Î÷ê°                                                 Îä²ý          	 \n"
"                            Ý               ÔÀÑô    	ý          	 \n"
"                                               ½ðÁê     ËÕÖÝ            \n"
"           Ñ©É½      		    	  ³¤É³       Ý   º¼ÖÝ    	 \n"
"			 	         	   	   ¼ÎÐË    ÌÒ»¨µº\n"		
"                  	                      	 		         \n"
"   	       ¹óÑô                                          	         \n"
"                             	   /\/\Ë®ÑÌ¸ó			 	 \n"                                                                           
"			                                	ÏÀ¿Íµº   \n"
"                   	         ¹ãÖÝ   +ÍíÔÂ+         	 	  	 \n" 
"			      ³¤´ºµº( ÌúÑª´óÆìÃÅ)		  	 \n");
	set("value", 10000);
	set("material", "paper");  
}
